Revit 2027 API
FabricationPart.AdjustEndLength Method
 Adjusts the length for the specified connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AdjustEndLength(
	Connector connector,
	double lengthToAdjust,
	bool totalLengthOnly
)
Public Function AdjustEndLength (
	connector As Connector,
	lengthToAdjust As Double,
	totalLengthOnly As Boolean
) As Double
public:
double AdjustEndLength(
	Connector^ connector,
	double lengthToAdjust,
	bool totalLengthOnly
)
member AdjustEndLength :
        connector : Connector *
        lengthToAdjust : float *
        totalLengthOnly : bool -> float
Parameters
connector Connector
 # The connector of the fabrication part to adjust length.
lengthToAdjust Double
 The length to adjust.
totalLengthOnly Boolean
 True if adjust the total length only when adjust length.
Return Value
Double
 The adjusted length.
Exceptions
Exception | Condition
ArgumentException |  The end of the fabrication part of the connector can not be adjusted. -or- Connector is connected.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace